tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf4480_tdd.h
#define RXB1EID8                      3323
#define RXB1EIDH_EID8                 3324
#define RXB1EID9                      3325
#define RXB1EIDH_EID9                 3326
#define RXB1EIDH_EID10                3327
#define RXB1EID10                     3328
#define RXB1EIDH_EID11                3329
#define RXB1EID11                     3330
#define RXB1EIDH_EID12                3331
#define RXB1EID12                     3332
#define RXB1EID13                     3333
#define RXB1EIDH_EID13                3334
#define RXB1EIDH_EID14                3335
#define RXB1EID14                     3336
#define RXB1EIDH_EID15                3337
#define RXB1EID15                     3338
#define RXB1EIDL                      3339
#define RXB1EIDL_EID0                 3340
#define RXB1EID0                      3341
#define RXB1EIDL_EID1                 3342
#define RXB1EID1                      3343
#define RXB1EIDL_EID2                 3344
#define RXB1EID2                      3345
#define RXB1EIDL_EID3                 3346
#define RXB1EID3                      3347
#define RXB1EIDL_EID4                 3348
#define RXB1EID4                      3349
#define RXB1EIDL_EID5                 3350
#define RXB1EID5                      3351
#define RXB1EIDL_EID6                 3352
#define RXB1EID6                      3353
#define RXB1EIDL_EID7                 3354
#define RXB1EID7                      3355
#define RXB1DLC                       3356
#define RXB1DLC0                      3357
#define RXB1DLC_DLC0                  3358
#define RXB1DLC1                      3359
#define RXB1DLC_DLC1                  3360
#define RXB1DLC2                      3361
#define RXB1DLC_DLC2                  3362
#define RXB1DLC3                      3363
#define RXB1DLC_DLC3                  3364
#define RXB1RB0                       3365
#define RXB1DLC_RESRB0                3366
#define RXB1DLC_RB0                   3367
#define RXB1RB1                       3368
#define RXB1DLC_RESRB1                3369
#define RXB1DLC_RB1                   3370
#define RXB1DLC_RXRTR                 3371
#define RXB1RTR                       3372
#define RXB1D0                        3373
#define RXB1D00                       3374
#define RXB1D01                       3375
#define RXB1D02                       3376
#define RXB1D03                       3377
#define RXB1D04                       3378
#define RXB1D05                       3379
#define RXB1D06                       3380
#define RXB1D07                       3381
#define RXB1D1                        3382
#define RXB1D10                       3383
#define RXB1D11                       3384
#define RXB1D12                       3385
#define RXB1D13                       3386
#define RXB1D14                       3387
#define RXB1D15                       3388
#define RXB1D16                       3389
#define RXB1D17                       3390
#define RXB1D2                        3391
#define RXB1D20                       3392
#define RXB1D21                       3393
#define RXB1D22                       3394
#define RXB1D23                       3395
#define RXB1D24                       3396
#define RXB1D25                       3397
#define RXB1D26                       3398
#define RXB1D27                       3399
#define RXB1D3                        3400
#define RXB1D30                       3401
#define RXB1D31                       3402
#define RXB1D32                       3403
#define RXB1D33                       3404
#define RXB1D34                       3405
#define RXB1D35                       3406
#define RXB1D36                       3407
#define RXB1D37                       3408
#define RXB1D4                        3409
#define RXB1D40                       3410
#define RXB1D41                       3411
#define RXB1D42                       3412
#define RXB1D43                       3413
#define RXB1D44                       3414
#define RXB1D45                       3415
#define RXB1D46                       3416
#define RXB1D47                       3417
#define RXB1D5                        3418
#define RXB1D50                       3419
#define RXB1D51                       3420
#define RXB1D52                       3421
#define RXB1D53                       3422
#define RXB1D54                       3423
#define RXB1D55                       3424
#define RXB1D56                       3425
#define RXB1D57                       3426
#define RXB1D6                        3427
#define RXB1D60                       3428
#define RXB1D61                       3429
#define RXB1D62                       3430
#define RXB1D63                       3431
#define RXB1D64                       3432
#define RXB1D65                       3433
#define RXB1D66                       3434
#define RXB1D67                       3435
#define RXB1D7                        3436
#define RXB1D70                       3437
#define RXB1D71                       3438
#define RXB1D72                       3439
#define RXB1D73                       3440
#define RXB1D74                       3441
#define RXB1D75                       3442
#define RXB1D76                       3443
#define RXB1D77                       3444
#define CANSTAT_RO0                   3445
#define CANSTAT_RO0_EICODE0           3446
#define CANSTAT_RO0_ICODE0            3447
#define CANSTAT_RO0_ICODE1            3448
#define CANSTAT_RO0_EICODE1_ICODE0    3449
#define CANSTAT_RO0_EICODE2_ICODE1    3450
#define CANSTAT_RO0_ICODE2            3451
#define CANSTAT_RO0_EICODE3_ICODE2    3452
#define CANSTAT_RO0_ICODE3            3453
#define CANSTAT_RO0_EICODE4           3454
#define CANSTAT_RO0_ICODE4            3455
#define CANSTAT_RO0_OPMODE0           3456
#define CANSTAT_RO0_OPMODE1           3457
#define CANSTAT_RO0_OPMODE2           3458
#define CANCON_RO0                    3459
#define CANCON_RO0_FP0                3460
#define CANCON_RO0_WIN0_FP1           3461
#define CANCON_RO0_WIN0               3462
#define CANCON_RO0_WIN1_FP2           3463
#define CANCON_RO0_WIN1               3464
#define CANCON_RO0_WIN2_FP3           3465
#define CANCON_RO0_WIN2               3466
#define CANCON_RO0_ABAT               3467
#define CANCON_RO0_REQOP0             3468
#define CANCON_RO0_REQOP1             3469
#define CANCON_RO0_REQOP2             3470
#define RXB0CON                       3471
#define RXB0CON_FILHIT0               3472
#define RXB0FILHIT0                   3473
#define JTOFF_FILHIT1                 3474
#define RXB0CON_FILHIT1               3475
#define RXB0FILHIT1                   3476
#define JTOFF                         3477
#define RXBODBEN                      3478
#define RXB0DBEN_FILHIT2              3479
#define RXB0DBEN                      3480
#define RXB0FILHIT2                   3481
#define RXB0CON_FILHIT2               3482
#define RXB0CON_RXRTRRO               3483
#define RXB0FILHIT3                   3484
#define RXB0CON_RXRTRRO_FILHIT3       3485
#define RXB0CON_FILHIT3               3486
#define RXB0RTRR0                     3487
#define RXB0CON_FILHIT4               3488
#define RXB0FILHIT4                   3489
#define RXB0RTRRO                     3490
#define RXB0CON_RXM0_RTRRO            3491
#define RXB0M0                        3492
#define RXB0CON_RTRRO                 3493
#define RXB0CON_RXM0                  3494
#define RXB0M1                        3495
#define RXB0CON_RXM1                  3496
#define RXB0FUL                       3497
#define RXB0CON_RXFUL                 3498
#define RXB0SIDH                      3499
#define RXB0SIDH_SID3                 3500
#define RXB0SID3                      3501
#define RXB0SIDH_SID4                 3502
#define RXB0SID4                      3503
#define RXB0SIDH_SID5                 3504
#define RXB0SID5                      3505
#define RXB0SIDH_SID6                 3506
#define RXB0SID6                      3507
#define RXB0SIDH_SID7                 3508
#define RXB0SID7                      3509
#define RXB0SIDH_SID8                 3510
#define RXB0SID8                      3511
#define RXB0SIDH_SID9                 3512
#define RXB0SID9                      3513
#define RXB0SIDH_SID10                3514
#define RXB0SID10                     3515
#define RXB0SIDL                      3516
#define RXB0SIDL_EID16                3517
#define RXB0EID16                     3518
#define RXB0SIDL_EID17                3519
#define RXB0EID17                     3520
#define RXB0EXID                      3521
#define RXB0SIDL_EXID                 3522
#define RXB0SRR                       3523
#define RXB0SIDL_SRR                  3524
#define RXB0SID0                      3525
#define RXB0SIDL_SID0                 3526
#define RXB0SID1                      3527
#define RXB0SIDL_SID1                 3528
#define RXB0SIDL_SID2                 3529
#define RXB0SID2                      3530
#define RXB0EIDH                      3531
#define RXB0EID8                      3532
#define RXB0EIDH_EID8                 3533
#define RXB0EID9                      3534
#define RXB0EIDH_EID9                 3535
#define RXB0EID10                     3536
#define RXB0EIDH_EID10                3537
#define RXB0EID11                     3538
#define RXB0EIDH_EID11                3539
#define RXB0EID12                     3540
#define RXB0EIDH_EID12                3541
#define RXB0EID13                     3542
#define RXB0EIDH_EID13                3543
#define RXB0EID14                     3544
#define RXB0EIDH_EID14                3545
#define RXB0EID15                     3546
#define RXB0EIDH_EID15                3547
#define RXB0EIDL                      3548
#define RXB0EID0                      3549
#define RXB0EIDL_EID0                 3550
#define RXB0EID1                      3551
#define RXB0EIDL_EID1                 3552
#define RXB0EID2                      3553
#define RXB0EIDL_EID2                 3554
#define RXB0EID3                      3555
#define RXB0EIDL_EID3                 3556
#define RXB0EID4                      3557
#define RXB0EIDL_EID4                 3558
#define RXB0EID5                      3559
#define RXB0EIDL_EID5                 3560
#define RXB0EID6                      3561
#define RXB0EIDL_EID6                 3562
#define RXB0EID7                      3563
#define RXB0EIDL_EID7                 3564
#define RXB0DLC                       3565
#define RXB0DLC_DLC0                  3566
#define RXB0DLC0                      3567
#define RXB0DLC1                      3568
#define RXB0DLC_DLC1                  3569
#define RXB0DLC2                      3570
#define RXB0DLC_DLC2                  3571
#define RXB0DLC3                      3572
#define RXB0DLC_DLC3                  3573
#define RXB0RB0                       3574
#define RXB0DLC_RB0                   3575
#define RXB0DLC_RESRB0                3576
#define RXB0RB1                       3577
#define RXB0DLC_RB1                   3578
#define RXB0DLC_RESRB1                3579
#define RXB0DLC_RXRTR                 3580
#define RXB0RTR                       3581
#define RXB0D0                        3582
#define RXB0D00                       3583
#define RXB0D01                       3584
#define RXB0D02                       3585
#define RXB0D03                       3586
#define RXB0D04                       3587
#define RXB0D05                       3588
#define RXB0D06                       3589
#define RXB0D07                       3590
#define RXB0D1                        3591
#define RXB0D10                       3592
#define RXB0D11                       3593
#define RXB0D12                       3594
#define RXB0D13                       3595
#define RXB0D14                       3596
#define RXB0D15                       3597
#define RXB0D16                       3598
#define RXB0D17                       3599
#define RXB0D2                        3600
#define RXB0D20                       3601
#define RXB0D21                       3602
#define RXB0D22                       3603
#define RXB0D23                       3604
#define RXB0D24                       3605
#define RXB0D25                       3606
#define RXB0D26                       3607
#define RXB0D27                       3608
#define RXB0D3                        3609
#define RXB0D30                       3610
#define RXB0D31                       3611
#define RXB0D32                       3612
#define RXB0D33                       3613
#define RXB0D34                       3614
#define RXB0D35                       3615
#define RXB0D36                       3616
#define RXB0D37                       3617
#define RXB0D4                        3618
#define RXB0D40                       3619
#define RXB0D41                       3620
#define RXB0D42                       3621
#define RXB0D43                       3622
#define RXB0D44                       3623
#define RXB0D45                       3624
#define RXB0D46                       3625
#define RXB0D47                       3626
#define RXB0D5                        3627
#define RXB0D50                       3628
#define RXB0D51                       3629
#define RXB0D52                       3630
#define RXB0D53                       3631
#define RXB0D54                       3632
#define RXB0D55                       3633
#define RXB0D56                       3634
#define RXB0D57                       3635
#define RXB0D6                        3636
#define RXB0D60                       3637
#define RXB0D61                       3638
#define RXB0D62                       3639
#define RXB0D63                       3640
#define RXB0D64                       3641
#define RXB0D65                       3642
#define RXB0D66                       3643
#define RXB0D67                       3644
#define RXB0D7                        3645
#define RXB0D70                       3646
#define RXB0D71                       3647
#define RXB0D72                       3648
#define RXB0D73                       3649
#define RXB0D74                       3650
#define RXB0D75                       3651
#define RXB0D76                       3652
#define RXB0D77                       3653
#define CANSTAT                       3654
#define CANSTAT_EICODE0               3655
#define CANSTAT_ICODE0                3656
#define CANSTAT_ICODE1                3657
#define EICODE1                       3658
#define CANSTAT_EICODE1_ICODE0        3659
#define CANSTAT_ICODE2                3660
#define CANSTAT_EICODE2_ICODE1        3661
#define EICODE2                       3662
#define CANSTAT_ICODE3                3663
#define EICODE3                       3664
#define CANSTAT_EICODE3_ICODE2        3665
#define CANSTAT_EICODE4               3666
#define CANSTAT_OPMODE0               3667
#define CANSTAT_OPMODE1               3668
#define CANSTAT_OPMODE2               3669
#define CANCON                        3670
#define CANCON_FP0                    3671
#define CANCON_WIN0                   3672
#define FP1                           3673
#define CANCON_WIN0_FP1               3674
#define CANCON_WIN1                   3675
#define CANCON_WIN1_FP2               3676
#define FP2                           3677
#define FP3                           3678
#define CANCON_WIN2                   3679
#define CANCON_WIN2_FP3               3680
#define CANCON_ABAT                   3681
#define CANCON_REQOP0                 3682
#define CANCON_REQOP1                 3683
#define CANCON_REQOP2                 3684
#define BRGCON1                       3685
#define BRP0                          3686
#define BRP1                          3687
#define BRP2                          3688
#define BRP3                          3689
#define BRP4                          3690
#define BRP5                          3691
#define SJW0                          3692
#define SJW1                          3693
#define BRGCON2                       3694
#define PRSEG0                        3695
#define PRSEG1                        3696
#define PRSEG2                        3697
#define SEG1PH0                       3698
#define SEG1PH1                       3699
#define SEG1PH2                       3700
#define SAM                           3701
#define SEG2PHT                       3702
#define SEG2PHTS                      3703
#define BRGCON3                       3704
#define SEG2PH0                       3705
#define SEG2PH1                       3706
#define SEG2PH2                       3707
#define WAKFIL                        3708
#define WAKDIS                        3709
#define CIOCON                        3710
#define CANCAP                        3711
#define ENDRHI                        3712
#define COMSTAT                       3713
#define EWARN                         3714
#define RXWARN                        3715
#define TXWARN                        3716
#define RXBP                          3717
#define TXBP                          3718
#define TXBO                          3719
#define RXBNOVFL                      3720
#define RXB1OVFL                      3721
#define RXBnOVFL                      3722
#define RXB0OVFL_nFIFOEMPTY           3723
#define RXB0OVFL_NOT_FIFOEMPTY        3724
#define FIFOEMPTY                     3725
#define RXB0OVFL                      3726
#define NOT_FIFOEMPTY                 3727
#define nFIFOEMPTY                    3728
#define RXERRCNT                      3729
#define REC0                          3730
#define REC1                          3731
#define REC2                          3732
#define REC3                          3733
#define REC4                          3734
#define REC5                          3735
#define REC6                          3736
#define REC7                          3737
#define TXERRCNT                      3738
#define TEC0                          3739
#define TEC1                          3740
#define TEC2                          3741
#define TEC3                          3742
#define TEC4                          3743
#define TEC5                          3744
#define TEC6                          3745
#define TEC7                          3746
#define ECANCON                       3747
#define EWIN0                         3748
#define EWIN1                         3749
#define EWIN2                         3750
#define EWIN3                         3751
#define EWIN4                         3752
#define FIFOWM                        3753
#define F                             3754
#define MDSEL0                        3755
#define MDSEL1                        3756
#define PORTA                         3757
#define PORTA_CVREF                   3758
#define AN0                           3759
#define ULPWUIN                       3760
#define PORTA_RA0                     3761
#define CVREFA                        3762
#define AN1                           3763
#define PORTA_RA1                     3764
#define AN2                           3765
#define PORTA_RA2                     3766
#define VREFM                         3767
#define AN3                           3768
#define PORTA_RA3                     3769
#define VREFP                         3770
#define PORTA_RA4                     3771
#define T0CKI                         3772
#define AN4                           3773
#define PORTA_RA5                     3774
#define NOT_SS                        3775
#define LVDIN                         3776
#define nSS                           3777
#define SS                            3778
#define HLVDIN                        3779
#define CLKO                          3780
#define PORTA_RA6                     3781
#define OSC2                          3782
#define CLKI                          3783
#define PORTA_RA7                     3784
#define OSC1                          3785
#define RJPU                          3786
#define PORTB                         3787
#define FLT0                          3788
#define INT0                          3789
#define PORTB_RB0                     3790
#define AN10                          3791
#define AN8                           3792
#define INT1                          3793
#define PORTB_RB1                     3794
#define CANTX                         3795
#define INT2                          3796
#define PORTB_RB2                     3797
#define CCP2_PA2                      3798
#define CANRX                         3799
#define PORTB_RB3                     3800
#define AN9                           3801
#define KBI0                          3802
#define PORTB_RB4                     3803
#define PGM                           3804
#define KBI1                          3805
#define PORTB_RB5                     3806
#define PGC                           3807
#define KBI2                          3808
#define PORTB_RB6                     3809
#define PGD                           3810
#define PORTB_RB7                     3811
#define KBI3                          3812
#define PORTC                         3813
#define T13CKI                        3814
#define T1OSO                         3815
#define PORTC_RC0                     3816
#define CCP2                          3817
#define T1OSI                         3818
#define PA2                           3819
#define PORTC_RC1                     3820
#define CCP1                          3821
#define PA1                           3822
#define PORTC_RC2                     3823
#define SCL                           3824
#define SCK                           3825
#define PORTC_RC3                     3826
#define SDA                           3827
#define SDI                           3828
#define PORTC_RC4                     3829
#define SDO                           3830
#define PORTC_RC5                     3831
#define TX                            3832
#define CK                            3833
#define PORTC_RC6                     3834
#define DT                            3835
#define RX                            3836
#define PORTC_RC7                     3837
#define PORTD                         3838
#define C1INB                         3839
#define PSP0                          3840
#define PORTD_RD0                     3841
#define C1INA                         3842
#define PSP1                          3843
#define PORTD_RD1                     3844
#define PSP2                          3845
#define PORTD_RD2                     3846
#define C2INB                         3847
#define PSP3                          3848
#define PORTD_RD3                     3849
#define C2INA                         3850
#define PSP4                          3851
#define P1A                           3852
#define ECCP1                         3853
#define PORTD_RD4                     3854
#define PSP5                          3855
#define P1B                           3856
#define PORTD_RD5                     3857
#define PSP6                          3858
#define P1C                           3859
#define PORTD_RD6                     3860
#define SS2                           3861
#define PSP7                          3862
#define P1D                           3863
#define PORTD_RD7                     3864
#define PORTE                         3865
#define PD2                           3866
#define RDE                           3867
#define PORTE_RE0                     3868
#define WRE                           3869
#define PC2                           3870
#define PORTE_RE1                     3871
#define CCP10                         3872
#define PB2                           3873
#define CS                            3874
#define PORTE_RE2                     3875
#define RE3                           3876
#define CCP9E                         3877
#define PC3E                          3878
#define LATA                          3879
#define LATA0                         3880
